CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_utils/string/test/test_sl_string.c
/* SIBROS TECHNOLOGIES, INC. CONFIDENTIAL
 * Copyright (c) 2018 - 2019 Sibros Technologies, Inc.
 * All Rights Reserved.
 * NOTICE: All information contained herein is, and remains the property of Sibros Technologies,
 * Inc. and its suppliers, if any. The intellectual and technical concepts contained herein are
 * proprietary to Sibros Technologies, Inc. and its suppliers and may be covered by U.S. and Foreign
 * Patents, patents in process, and are protected by trade secret or copyright law. Dissemination of
 * this information or reproduction of this material is strictly forbidden unless prior written
 * permission is obtained from Sibros Technologies, Inc.
 */

#include <stdio.h>
#include <string.h>

#include "unity.h"

#include "sl_utils.h"

#include "sl_byte_conversions.h"

// Module includes
#include "sl_string.h"

#include "sl_unit_test_facilitator.h"

/******************************************************************************
 *
 *                               D E F I N E S
 *
 *****************************************************************************/
const size_t sl_header_length = sizeof(sl_string_size_t);
static const char *test_very_long_string =
    "test test test test test test test test test test test test test test test test test test test test test";

/*******************************************************************************
 *
 *                                 E N U M S
 *
 ******************************************************************************/

/******************************************************************************
 *
 *                              T Y P E D E F S
 *
 *****************************************************************************/

/******************************************************************************
 *
 *        P R I V A T E    F U N C T I O N    D E C L A R A T I O N S
 *
 *****************************************************************************/
static char string_memory[110];
static sl_string_t str;
static const size_t string_memory_pad_size = 10;
/******************************************************************************
 *
 *             P R I V A T E    D A T A    D E F I N I T I O N S
 *
 *****************************************************************************/

/******************************************************************************
 *
 *                     P R I V A T E    F U N C T I O N S
 *
 *****************************************************************************/

/******************************************************************************
 *
 *                T E S T    S E T U P    &    T E A R D O W N
 *
 *****************************************************************************/
void setUp(void) {
  memset(string_memory, 'p', sizeof(string_memory));
  str = sl_string__initialize(string_memory, sizeof(string_memory) - string_memory_pad_size);
}

void tearDown(void) {
  const char *expected_str = "pppppppppp";
  TEST_ASSERT_EQUAL_STRING(expected_str, string_memory + sizeof(string_memory) - string_memory_pad_size);
}

/******************************************************************************
 *
 *                                 T E S T S
 *
 *****************************************************************************/

void test_sl_string__initialize_successful(void) {
  TEST_ASSERT_EQUAL_PTR(string_memory + 2, str);
  TEST_ASSERT_EQUAL_UINT(sizeof(string_memory) - string_memory_pad_size, ((str[-2]) << 8) | str[-1]);
}

void test_sl_string__initialize_unsuccessful_null_mem(void) {
  sl_string_t null_str = sl_string__initialize(NULL, sizeof(string_memory) - string_memory_pad_size);

  TEST_ASSERT_EQUAL_PTR(NULL, null_str);
}

void test_sl_string__initialize_unsuccessful_mem_size_zero(void) {
  sl_string_t null_str = sl_string__initialize(string_memory, 0);

  TEST_ASSERT_EQUAL_PTR(NULL, null_str);
}

void test_sl_string__initialize_from_successful(void) {
  sl_string_t intalized_from_str =
      sl_string__initialize_from(string_memory, sizeof(string_memory) - string_memory_pad_size, "Hello World");

  TEST_ASSERT_EQUAL_PTR(string_memory + 2, str);
  TEST_ASSERT_EQUAL_UINT(sizeof(string_memory) - string_memory_pad_size, ((str[-2]) << 8) | str[-1]);
  TEST_ASSERT_EQUAL_STRING("Hello World", intalized_from_str);
}

void test_sl_string__initialize_from_null_init_string(void) {
  sl_string_t intalized_from_str =
      sl_string__initialize_from(string_memory, sizeof(string_memory) - string_memory_pad_size, NULL);

  TEST_ASSERT_EQUAL_PTR(string_memory + 2, str);
  TEST_ASSERT_EQUAL_UINT(sizeof(string_memory) - string_memory_pad_size, ((str[-2]) << 8) | str[-1]);
  TEST_ASSERT_EQUAL_STRING("", intalized_from_str);
}

void test_sl_string__initialize_from_null_string_memory(void) {
  char *str_mem = NULL;
  sl_string_t intalized_from_str = sl_string__initialize_from(str_mem, 0, NULL);

  TEST_ASSERT_EQUAL_PTR(NULL, intalized_from_str);
}

void test_sl_string__get_capacity(void) {
  TEST_ASSERT_EQUAL_UINT(sizeof(string_memory) - string_memory_pad_size - sl_header_length - 1,
                         sl_string__get_capacity(str));
}

void test_sl_string__get_length_empty_string(void) { TEST_ASSERT_EQUAL_UINT(0, sl_string__get_length(str)); }

void test_sl_string__get_length_non_empty_string(void) {
  const char *hello = "hello world";
  sl_string__append(str, hello);

  TEST_ASSERT_EQUAL_UINT(strlen(hello), sl_string__get_length(str));
}

void test_sl_string__c_str_empty_string(void) {
  TEST_ASSERT_EQUAL_STRING("", sl_string__c_str(str));
  TEST_ASSERT_EQUAL(sl_string__c_str(str), str);
}

void test_sl_string__c_str_non_empty_string(void) {
  const char *hello = "hello world";
  sl_string__append(str, hello);

  TEST_ASSERT_EQUAL_STRING(hello, sl_string__c_str(str));
  TEST_ASSERT_EQUAL(sl_string__c_str(str), str);
}

void test_sl_string__to_int_successful(void) {
  sl_string__printf(str, "%s", "123");

  TEST_ASSERT_EQUAL_INT(123, sl_string__to_int(str));

  sl_string__printf(str, "%s", "-123");

  TEST_ASSERT_EQUAL_INT(-123, sl_string__to_int(str));
}

void test_sl_string__to_int_unsuccessful_contains_non_int_chars(void) {
  sl_string__printf(str, "%s", "Hello 123 Word");

  TEST_ASSERT_EQUAL_INT(0, sl_string__to_int(str));

  sl_string__printf(str, "%s", "$123#");

  TEST_ASSERT_EQUAL_INT(0, sl_string__to_int(str));

  sl_string__printf(str, "%s", "Hello $123# Word");

  TEST_ASSERT_EQUAL_INT(0, sl_string__to_int(str));
}

void test_sl_string__to_int_unsuccessful_empty_string(void) { TEST_ASSERT_EQUAL_INT(0, sl_string__to_int(str)); }

void test_sl_string__to_float_successful(void) {
  sl_string__printf(str, "%s", "1.23");

  TEST_ASSERT_EQUAL_FLOAT(1.23, sl_string__to_float(str));

  sl_string__printf(str, "%s", "-1.23");

  TEST_ASSERT_EQUAL_FLOAT(-1.23, sl_string__to_float(str));

  sl_string__printf(str, "%s", "+1.23f");

  TEST_ASSERT_EQUAL_FLOAT(1.23, sl_string__to_float(str));
}

