CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_utils/string/test/test_sl_string.c
void test_sl_string__to_float_unsuccessful_contains_non_float_chars(void) {
  sl_string__printf(str, "%s", "Hello 1.23 Word");

  TEST_ASSERT_EQUAL_FLOAT(0.0, sl_string__to_float(str));

  sl_string__printf(str, "%s", "$1.23#");

  TEST_ASSERT_EQUAL_FLOAT(0.0, sl_string__to_float(str));

  sl_string__printf(str, "%s", "Hello $1.23# Word");

  TEST_ASSERT_EQUAL_FLOAT(0.0, sl_string__to_float(str));
}

void test_sl_string__to_float_unsuccessful_empty_string(void) {
  TEST_ASSERT_EQUAL_FLOAT(0.0, sl_string__to_float(str));
}

void test_sl_string__is_alpha_contains_only_alpha_chars(void) {
  sl_string__append(str, "HelloWorld");

  TEST_ASSERT_TRUE(sl_string__is_alpha(str));
}

void test_sl_string__is_alpha_contains_non_alpha_chars(void) {
  sl_string__append(str, "Hello$123# Word");

  TEST_ASSERT_FALSE(sl_string__is_alpha(str));
}

void test_sl_string__is_alpha_empty_string(void) { TEST_ASSERT_TRUE(sl_string__is_alpha(str)); }

void test_sl_string__is_alphanum_successful(void) {
  sl_string__printf(str, "%s", "Hello123Word");

  TEST_ASSERT_TRUE(sl_string__is_alphanum(str));

  sl_string__printf(str, "%s", "HelloWorld");

  TEST_ASSERT_TRUE(sl_string__is_alphanum(str));

  sl_string__printf(str, "%s", "123");

  TEST_ASSERT_TRUE(sl_string__is_alphanum(str));
}

void test_sl_string__is_alphanum_contains_non_alphanum_chars(void) {
  sl_string__append(str, "Hello $123#Word");

  TEST_ASSERT_FALSE(sl_string__is_alphanum(str));
}

void test_sl_string__is_alphanum_empty_string(void) { TEST_ASSERT_TRUE(sl_string__is_alphanum(str)); }

void test_sl_string__clear(void) {
  sl_string__append(str, "Hello World");

  sl_string__clear(str);

  TEST_ASSERT_EQUAL_UINT8('\0', str[0]);
  TEST_ASSERT_EQUAL_STRING("", str);
}

void test_sl_string__clear_all_memory(void) {
  sl_string__append(str, "Hello World");

  sl_string__clear_all_memory(str);
  for (uint16_t character = 0; character < sizeof(string_memory) - string_memory_pad_size; character++) {
    TEST_ASSERT_EQUAL_UINT8('\0', str[0]);
  }

  TEST_ASSERT_EQUAL_STRING("", str);
}

void test_sl_string__to_lower(void) {
  sl_string__append(str, "Hello World");

  sl_string__to_lower(str);

  TEST_ASSERT_EQUAL_STRING("hello world", str);
}

void test_sl_string__to_upper(void) {
  sl_string__append(str, "Hello World");

  sl_string__to_upper(str);

  TEST_ASSERT_EQUAL_STRING("HELLO WORLD", str);
}

void test_sl_string__printf_successful(void) {
  const int printed_count = sl_string__printf(str, "String1 %s, Int: %d, String2: %s", "Hello", 123, "World");
  const char *expected_str = "String1 Hello, Int: 123, String2: World";

  TEST_ASSERT_EQUAL_INT(strlen(expected_str), printed_count);
  TEST_ASSERT_EQUAL_STRING(expected_str, str);
}

void test_sl_string__printf_with_string_size_zero(void) {
  static sl_string_t m_str = sl_string__initialize(string_memory, sizeof(string_memory) - string_memory_pad_size);
  const int printed_count = sl_string__printf(m_str, "%s", "");
  TEST_ASSERT_EQUAL_INT(0, printed_count);
}

void test_sl_string__printf_append_with_string_size_zero(void) {
  static sl_string_t m_str = sl_string__initialize(string_memory, sizeof(string_memory) - string_memory_pad_size);
  const int printed_count = sl_string__printf_append(m_str, "%s", "");
  TEST_ASSERT_EQUAL_INT(0, printed_count);
}

void test_sl_string__printf_filename_format(void) {
  const char *expected_filename = "logs/debuglog__predump.in_use";
  const sl_string_t directory_name = "logs";
  const sl_string_t preceding_name = "debuglog";
  const sl_string_t tagname = "predump";
  static sl_string_t file_name = sl_string__initialize(string_memory, sizeof(string_memory) - string_memory_pad_size);
  const int printed_count = sl_string__printf(file_name, "%s/%s__%s.in_use", directory_name, preceding_name, tagname);
  TEST_ASSERT_EQUAL_INT(strlen(file_name), printed_count);
  TEST_ASSERT_EQUAL_STRING(expected_filename, file_name);
}

void test_sl_string__scanf_with_arg_size_zero(void) {
  char *hello_str = "";
  static sl_string_t m_str = sl_string__initialize(string_memory, sizeof(string_memory) - string_memory_pad_size);
  int parsed_count = sl_string__scanf(m_str, "%s", hello_str);
  TEST_ASSERT_EQUAL_INT(0, parsed_count);
}

void test_sl_string__printf_truncated(void) {
  const int printed_count =
      sl_string__printf(str, "String1 %s, Int: %d, String2: %s", test_very_long_string, 123, "test");
  const char *expected_str =
      "String1 test test test test test test test test test test test test test test test test test test";
  const char *expected_str_before_truncation =
      "String1 test test test test test test test test test test test test test test test test test test test test "
      "test, Int: 123, String2: test";

  TEST_ASSERT_EQUAL_INT(strlen(expected_str_before_truncation), printed_count);
  TEST_ASSERT_EQUAL_STRING(expected_str, str);
}

void test_sl_string__printf_append_successful(void) {
  sl_string__append(str, "Append ");
  const int printed_count = sl_string__printf_append(str, "String1 %s, Int: %d, String2: %s", "Hello", 123, "World");
  const char *expected_str_appended = "String1 Hello, Int: 123, String2: World";
  const char *expected_str = "Append String1 Hello, Int: 123, String2: World";

  TEST_ASSERT_EQUAL_INT(strlen(expected_str_appended), printed_count);
  TEST_ASSERT_EQUAL_STRING(expected_str, str);
}

void test_sl_string__printf_append_truncated(void) {
  sl_string__append(str, "Append ");
  int printed_count =
      sl_string__printf_append(str, "String1 %s, Int: %d, String2: %s", test_very_long_string, 123, "test");
  const char *expected_str =
      "Append String1 test test test test test test test test test test test test test test test test te";
  const char *expected_str_appended_before_truncation =
      "String1 test test test test test test test test test test test test test test test test test test test test "
      "test, Int: 123, String2: test";

  TEST_ASSERT_EQUAL_INT(strlen(expected_str_appended_before_truncation), printed_count);
  TEST_ASSERT_EQUAL_STRING(expected_str, str);

  printed_count = sl_string__printf_append(str, "%s", test_very_long_string);

  TEST_ASSERT_EQUAL_INT(strlen(test_very_long_string), printed_count);
  TEST_ASSERT_EQUAL_STRING(expected_str, str);
}

