CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_utils/string/test/test_sl_string.c
void test_sl_string__scanf_successful(void) {
  char string1[20];
  char string2[20];
  int num = 0;

  sl_string__append(str, "Hello 123 World");
  const int scanned_count = sl_string__scanf(str, "%20s %d %20s", string1, &num, string2);

  TEST_ASSERT_EQUAL_INT(3, scanned_count);
  TEST_ASSERT_EQUAL_STRING("Hello", string1);
  TEST_ASSERT_EQUAL_INT(123, num);
  TEST_ASSERT_EQUAL_STRING("World", string2);
}

void test_sl_string__tokenize_successful(void) {
  sl_string__append(str, "Hello 123 World");

  char *one = NULL;
  char *two = NULL;
  char *three = NULL;

  TEST_ASSERT_EQUAL_INT(3, sl_string__tokenize(str, " ", 3, &one, &two, &three));

  TEST_ASSERT_EQUAL_STRING("Hello", one);
  TEST_ASSERT_EQUAL_STRING("123", two);
  TEST_ASSERT_EQUAL_STRING("World", three);
}

void test_sl_string__tokenize_unsuccessful_null_delimiter(void) {
  sl_string__append(str, "Hello 123 Word");

  char *one = NULL;
  char *two = NULL;
  char *three = NULL;

  TEST_ASSERT_EQUAL_INT(-1, sl_string__tokenize(str, NULL, 3, &one, &two, &three));

  TEST_ASSERT_EQUAL_STRING(NULL, one);
  TEST_ASSERT_EQUAL_STRING(NULL, two);
  TEST_ASSERT_EQUAL_STRING(NULL, three);
}

void test_sl_string__tokenize_null_args(void) {
  sl_string__append(str, "Hello,123,Word");
  TEST_ASSERT_EQUAL_INT(1, sl_string__tokenize(str, ",", 1, NULL));
}

void test_sl_string__tokenize_mismatch_of_ptrs_and_num_of_tokens(void) {
  sl_string__append(str, "Hello 123 Word");

  char *one = NULL;
  char *two = NULL;
  char *three = NULL;

  TEST_ASSERT_EQUAL_INT(2, sl_string__tokenize(str, " ", 2, &one, &two));

  TEST_ASSERT_EQUAL_STRING("Hello", one);
  TEST_ASSERT_EQUAL_STRING("123", two);
  TEST_ASSERT_EQUAL_STRING(NULL, three);
}

void test_sl_string__set(void) {
  TEST_ASSERT_TRUE(sl_string__set(str, "hello"));
  TEST_ASSERT_EQUAL_STRING("hello", str);

  // When string does not have enough memory (capacity is 2 when memory length is 5)
  str = sl_string__initialize(string_memory, 5);
  TEST_ASSERT_TRUE(sl_string__set(str, "hi"));
  TEST_ASSERT_EQUAL_STRING("hi", str);
  TEST_ASSERT_TRUE(sl_string__set(str, "I"));
  TEST_ASSERT_EQUAL_STRING("I", str);
}

void test_sl_string__insert_at_success(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__insert_at(str, 5, "Hello 123 World"));

  TEST_ASSERT_EQUAL_STRING("HelloHello 123 World World", str);
}

void test_sl_string__insert_at_pos_out_of_bounds(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__insert_at(str, sizeof("Hello World"), "Hello 123 Word"));

  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__insert_at_string_is_null(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__insert_at(str, 5, NULL));

  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__insert_at_capacity_reached(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__insert_at(str, 5, test_very_long_string));

  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__append_successful(void) {
  TEST_ASSERT_TRUE(sl_string__append(str, "Hello World"));

  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__append_string_is_null(void) {
  TEST_ASSERT_FALSE(sl_string__append(str, NULL));

  TEST_ASSERT_EQUAL_STRING("", str);
}

void test_sl_string__append_capacity_reached(void) {
  TEST_ASSERT_FALSE(sl_string__append(str, test_very_long_string));

  TEST_ASSERT_EQUAL_STRING("", str);
}

void test_sl_string__equals_to_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__equals_to(str, "Hello World"));
}

void test_sl_string__equals_to_unsuccessful_strings_dont_match(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__equals_to(str, "hello world"));
}

void test_sl_string__equals_to_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__equals_to(str, NULL));
}

void test_sl_string__equals_to_ignore_case_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__equals_to_ignore_case(str, "HelLo WoRld"));
  TEST_ASSERT_TRUE(sl_string__equals_to_ignore_case(str, "hello world"));
}

void test_sl_string__equals_to_ignore_case_unsuccessful_strings_dont_match(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__equals_to_ignore_case(str, "Hello 123 Word"));
}

void test_sl_string__equals_to_ignore_case_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__equals_to_ignore_case(str, NULL));
}

void test_sl_string__last_index_of_found(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(12, sl_string__last_index_of(str, "Hello"));
}

void test_sl_string__last_index_of_unsuccessful_not_found(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__last_index_of(str, "hello"));
}

void test_sl_string__last_index_of_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__last_index_of(str, NULL));
}

void test_sl_string__last_index_of_ignore_case_found(void) {
  sl_string__printf(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(12, sl_string__last_index_of_ignore_case(str, "hello"));

  sl_string__printf(str, "Hello World HHello World");

  TEST_ASSERT_EQUAL_INT(13, sl_string__last_index_of_ignore_case(str, "hello"));
}

void test_sl_string_last_index_of_ignore_lower_case(void) {
  sl_string__append(str, "hello WORLD");

  TEST_ASSERT_EQUAL_INT(0, sl_string__last_index_of_ignore_case(str, "HELLO"));
}

void test_sl_string_last_index_of_ignore_multiple_sub_string(void) {
  sl_string__append(str, "hello WORLD hello hello");

  TEST_ASSERT_EQUAL_INT(18, sl_string__last_index_of_ignore_case(str, "hello"));
}

void test_sl_string__last_index_of_ignore_case_not_found(void) {
  TEST_ASSERT_EQUAL_INT(-1, sl_string__last_index_of_ignore_case(str, "hey"));
}

void test_sl_string__last_index_of_ignore_case_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__last_index_of_ignore_case(str, NULL));
}

