CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_utils/string/test/test_sl_string.c
void test_sl_string__first_index_of_found(void) {
  sl_string__printf(str, "%s", "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(0, sl_string__first_index_of(str, "Hello"));

  sl_string__printf(str, "%s", "HHello World Hello World");

  TEST_ASSERT_EQUAL_INT(1, sl_string__first_index_of(str, "Hello"));
}

void test_sl_string__first_index_of_unsuccessful_not_found(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__first_index_of(str, "hello"));
}

void test_sl_string__first_index_of_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__first_index_of(str, NULL));
}

void test_sl_string__first_index_of_ignore_case_found(void) {
  sl_string__printf(str, "%s", "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(0, sl_string__first_index_of_ignore_case(str, "hello"));

  sl_string__printf(str, "%s", "HHello World Hello World");

  TEST_ASSERT_EQUAL_INT(1, sl_string__first_index_of(str, "Hello"));
}

void test_sl_string__first_index_of_ignore_case_not_found(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__first_index_of_ignore_case(str, "hey"));
}

void test_sl_string__first_index_of_ignore_case_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__first_index_of_ignore_case(str, NULL));
}

void test_sl_string_first_index_of_ignore_lower_case(void) {
  sl_string__append(str, "hello HeLLO WORLD");

  TEST_ASSERT_EQUAL_INT(0, sl_string__first_index_of_ignore_case(str, "HeLLO"));
}

void test_sl_string__contains_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__contains(str, "Hello"));
}

void test_sl_string__contains_unsuccessful_not_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__contains(str, "hello"));
}

void test_sl_string__contains_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__contains(str, NULL));
}

void test_sl_string__contains_ignore_case_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__contains_ignore_case(str, "hello"));
}

void test_sl_string__contains_ignore_case_not_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__contains_ignore_case(str, "hey"));
}

void test_sl_string__contains_ignore_case_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__contains_ignore_case(str, NULL));
}

void test_sl_string__count_of_successful(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(2, sl_string__count_of(str, "World"));
}

void test_sl_string__count_of_no_occurance(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(0, sl_string__count_of(str, "hey"));
}

void test_sl_string__count_of_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World Hello World");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__count_of(str, NULL));
}

void test_sl_string__begins_with_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__begins_with(str, "Hello"));
}

void test_sl_string__begins_with_unsuccessful_not_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__begins_with(str, "World"));
}

void test_sl_string__begins_with_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__begins_with(str, NULL));
}

void test_sl_string__begins_unsuccessful_large_substring(void) {
  sl_string__append(str, "world");

  TEST_ASSERT_FALSE(sl_string__begins_with(str, "Hello World"));
}

void test_sl_string__begins_with_limited_chars(void) {
  sl_string__append(str, "test begins with");

  TEST_ASSERT_TRUE(sl_string__begins_with_limited_chars(str, "test", 1));
  TEST_ASSERT_TRUE(sl_string__begins_with_limited_chars(str, "test", 2));
  TEST_ASSERT_TRUE(sl_string__begins_with_limited_chars(str, "test", 3));
  TEST_ASSERT_TRUE(sl_string__begins_with_limited_chars(str, "test", 4));

  TEST_ASSERT_TRUE(sl_string__begins_with_limited_chars(str, "test ", 5));
  TEST_ASSERT_TRUE(sl_string__begins_with_limited_chars(str, "test b", 6));

  TEST_ASSERT_FALSE(sl_string__begins_with_limited_chars(str, "tesT", 4));
  TEST_ASSERT_FALSE(sl_string__begins_with_limited_chars(str, "ab", 2));
  TEST_ASSERT_FALSE(sl_string__begins_with_limited_chars(str, "tx", 2));
}

void test_sl_string__begins_with_ignore_case_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__begins_with_ignore_case(str, "hElLo"));
}

void test_sl_string__begins_with_ignore_case_not_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__begins_with_ignore_case(str, "hey"));
}

void test_sl_string__begins_with_ignore_case_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__begins_with_ignore_case(str, NULL));
}

void test_sl_string__begins_ignore_case_unsuccessful_large_substring(void) {
  sl_string__append(str, "world");

  TEST_ASSERT_FALSE(sl_string__begins_with_ignore_case(str, "hEllo World"));
}

void test_sl_string__begins_with_whole_word_found(void) {
  sl_string__printf(str, "%s", "Hello World");

  TEST_ASSERT_TRUE(sl_string__begins_with_whole_word(str, "Hello", " "));

  sl_string__printf(str, "%s", "Hello;World");

  TEST_ASSERT_TRUE(sl_string__begins_with_whole_word(str, "Hello", ";"));
}

void test_sl_string__begins_with_whole_word_unsuccessful_large_substring(void) {
  sl_string__append(str, "World");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word(str, "Hello World", ""));
}

void test_sl_string__begins_with_whole_word_not_matching(void) {
  sl_string__append(str, "World");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word(str, "orld", ""));
}

void test_sl_string__begins_with_whole_word_string_ends_with_null(void) {
  sl_string__append(str, "World\0");
  TEST_ASSERT_TRUE(sl_string__begins_with_whole_word(str, "World", ","));
}

void test_sl_string__begins_with_whole_word_unsuccessful_not_found(void) {
  sl_string__append(str, "HelloWorld");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word(str, "Hello", " "));
}

void test_sl_string__begins_with_whole_word_unsuccessful_null_params(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word(str, NULL, " "));
  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word(str, "Hello", NULL));
}

void test_sl_string__begins_with_whole_word_ignore_case_found(void) {
  sl_string__printf(str, "%s", "Hello World");

