CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_utils/string/test/test_sl_string.c
  TEST_ASSERT_TRUE(sl_string__begins_with_whole_word_ignore_case(str, "HeLlO", " "));

  sl_string__printf(str, "%s", "Hello;World");

  TEST_ASSERT_TRUE(sl_string__begins_with_whole_word_ignore_case(str, "heLlO", ";"));
}

void test_sl_string__begins_with_whole_word_ignore_case_not_found(void) {
  sl_string__append(str, "HelloWorld");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word_ignore_case(str, "HeLlO", " "));
}

void test_sl_string__begins_with_whole_word_ignore_case_unsuccessful_null_params(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word_ignore_case(str, NULL, " "));
  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word_ignore_case(str, "Hello", NULL));
}

void test_sl_string__begins_with_whole_word_ignore_case_unsuccessful_large_substring(void) {
  sl_string__append(str, "World");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word_ignore_case(str, "Hello World", ""));
}

void test_sl_string__begins_with_whole_word_ignore_case_not_matching(void) {
  sl_string__append(str, "World");

  TEST_ASSERT_FALSE(sl_string__begins_with_whole_word_ignore_case(str, "orld", ""));
}

void test_sl_string__begins_with_whole_word_ignore_case_string_delimeter_null(void) {
  sl_string__append(str, "World,");
  TEST_ASSERT_TRUE(sl_string__begins_with_whole_word_ignore_case(str, "World", "\0"));
}

void test_sl_string__ends_with_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__ends_with(str, "World"));
}

void test_sl_string__ends_with_unsuccessful_large_substring(void) {
  sl_string__append(str, "Hello");

  TEST_ASSERT_FALSE(sl_string__ends_with(str, "Hello World"));
}

void test_sl_string__ends_with_unsuccessful_not_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__ends_with(str, "Hello"));
}

void test_sl_string__ends_with_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__ends_with(str, NULL));
}

void test_sl_string__ends_with_ignore_case_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__ends_with_ignore_case(str, "wOrLd"));
}

void test_sl_string__ends_with_ignore_case_unsuccessful_large_substring(void) {
  sl_string__append(str, "Hello");

  TEST_ASSERT_FALSE(sl_string__ends_with_ignore_case(str, "Hello World"));
}

void test_sl_string__ends_with_ignore_case_not_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__ends_with_ignore_case(str, "hELLo"));
}

void test_sl_string__ends_with_ignore_case_unsuccessful_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__ends_with_ignore_case(str, NULL));
}

void test_sl_string__erase_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase(str, "Hello"));

  TEST_ASSERT_EQUAL_STRING(" World", str);
}

void test_sl_string__erase_null_substring(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__erase(str, NULL));
  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__erase_substring_not_found(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__erase(str, "hey"));
  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__erase_first_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_first(str, 4));
  TEST_ASSERT_EQUAL_STRING("o World", str);
}

void test_sl_string__erase_first_n_chars_longer_than_string(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_first(str, sl_string__get_length(str) + 1));
  TEST_ASSERT_EQUAL_STRING("", str);
}

void test_sl_string__erase_last_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_last(str, 4));
  TEST_ASSERT_EQUAL_STRING("Hello W", str);
}

void test_sl_string__erase_last_n_chars_longer_than_string(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_last(str, sl_string__get_length(str) + 1));
  TEST_ASSERT_EQUAL_STRING("", str);
}

void test_sl_string__erase_at_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_at(str, 6));
  TEST_ASSERT_EQUAL_STRING("Hello orld", str);
}

void test_sl_string__erase_at_index_out_of_bounds(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__erase_at(str, sl_string__get_length(str) + 1));
  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__erase_after_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_after(str, 2, 3));
  TEST_ASSERT_EQUAL_STRING("He World", str);
}

void test_sl_string__erase_after_index_out_of_bounds(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_FALSE(sl_string__erase_after(str, sl_string__get_length(str) + 1, 3));
  TEST_ASSERT_EQUAL_STRING("Hello World", str);
}

void test_sl_string__erase_after_n_chars_longer_than_string(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_after(str, 0, sl_string__get_length(str) + 1));
  TEST_ASSERT_EQUAL_STRING("", str);
}

void test_sl_string__erase_first_word_successful(void) {
  sl_string__append(str, "Hello World");

  TEST_ASSERT_TRUE(sl_string__erase_first_word(str, ' '));
  TEST_ASSERT_EQUAL_STRING("World", str);
}

void test_sl_string__erase_first_word_no_words(void) {
  sl_string__append(str, "HelloWorld");

  TEST_ASSERT_FALSE(sl_string__erase_first_word(str, ' '));
  TEST_ASSERT_EQUAL_STRING("HelloWorld", str);
}

void test_sl_string__erase_special_chars_successful(void) {
  sl_string__append(str, "He@llo $123& Wor*ld");

  TEST_ASSERT_EQUAL_UINT16(6, sl_string__erase_special_chars(str));
  TEST_ASSERT_EQUAL_STRING("Hello123World", str);
}

void test_sl_string__erase_special_chars_no_special_chars(void) {
  sl_string__append(str, "Hello123World");

  TEST_ASSERT_EQUAL_UINT16(0, sl_string__erase_special_chars(str));
  TEST_ASSERT_EQUAL_STRING("Hello123World", str);
}

void test_erase_int(void) {
  sl_string_t s = sl_string__initialize_from(string_memory, sizeof(string_memory) - string_memory_pad_size, "111 222ab333 ;a.444");
  int result = -1;

  TEST_ASSERT_TRUE(sl_string__erase_int(s, &result));
  TEST_ASSERT_EQUAL_INT(111, result);

  TEST_ASSERT_TRUE(sl_string__erase_int(s, &result));
  TEST_ASSERT_EQUAL_INT(222, result);

  TEST_ASSERT_TRUE(sl_string__erase_int(s, &result));
  TEST_ASSERT_EQUAL_INT(333, result);

  TEST_ASSERT_TRUE(sl_string__erase_int(s, &result));
  TEST_ASSERT_EQUAL_INT(444, result);
  printf("String is '%s'\n", s);

  TEST_ASSERT_FALSE(sl_string__erase_int(s, &result));
  TEST_ASSERT_EQUAL_INT(444, result);
  TEST_ASSERT_FALSE(sl_string__erase_int(s, &result));
  TEST_ASSERT_EQUAL_INT(444, result);
}

