CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_utils/string/test/test_sl_string.c
void test_sl_string__trim_end_successful(void) {
  sl_string__append(str, "./././123 ***");

  TEST_ASSERT_TRUE(sl_string__trim_end(str, "./*"));
  TEST_ASSERT_EQUAL_STRING("./././123 ", str);
}

void test_sl_string__trim_end_null_chars_to_trim(void) {
  sl_string__append(str, "./././123 ***");

  TEST_ASSERT_FALSE(sl_string__trim_end(str, NULL));
  TEST_ASSERT_EQUAL_STRING("./././123 ***", str);
}

void test_sl_string__trim_end_chars_not_found(void) {
  sl_string__append(str, "./././123 ***");

  TEST_ASSERT_TRUE(sl_string__trim_end(str, "./"));
  TEST_ASSERT_EQUAL_STRING("./././123 ***", str);
}

void test_sl_string__trim_start_successful(void) {
  sl_string__append(str, "./././123 ***");

  TEST_ASSERT_TRUE(sl_string__trim_start(str, "./*"));
  TEST_ASSERT_EQUAL_STRING("123 ***", str);
}

void test_sl_string__trim_start_null_chars_to_trim(void) {
  sl_string__append(str, "./././123 ***");

  TEST_ASSERT_FALSE(sl_string__trim_start(str, NULL));
  TEST_ASSERT_EQUAL_STRING("./././123 ***", str);
}

void test_sl_string__trim_start_chars_not_found(void) {
  sl_string__append(str, "./././123 ***");

  TEST_ASSERT_TRUE(sl_string__trim_start(str, "*"));
  TEST_ASSERT_EQUAL_STRING("./././123 ***", str);
}

void test_sl_string__replace_first_successful(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_TRUE(sl_string__replace_first(str, "Hello", "World"));
  TEST_ASSERT_EQUAL_STRING("World World Hello", str);
}

void test_sl_string__replace_first_null_params(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_FALSE(sl_string__replace_first(str, NULL, "World"));
  TEST_ASSERT_FALSE(sl_string__replace_first(str, "Hello", NULL));
  TEST_ASSERT_FALSE(sl_string__replace_first(str, NULL, NULL));

  TEST_ASSERT_EQUAL_STRING("Hello World Hello", str);
}

void test_sl_string__replace_first_substring_not_found(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_TRUE(sl_string__replace_first(str, "hey", "World"));
  TEST_ASSERT_EQUAL_STRING("Hello World Hello", str);
}

void test_sl_string__replace_first_empty_string_and_replace_string(void) {
  sl_string__append(str, "");

  TEST_ASSERT_FALSE(sl_string__replace_first(str, "", "World"));
}

void test_sl_string__replace_last_successful(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_TRUE(sl_string__replace_last(str, "Hello", "World"));
  TEST_ASSERT_EQUAL_STRING("Hello World World", str);
}

void test_sl_string__replace_last_null_params(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_FALSE(sl_string__replace_last(str, NULL, "World"));
  TEST_ASSERT_FALSE(sl_string__replace_last(str, "Hello", NULL));
  TEST_ASSERT_FALSE(sl_string__replace_last(str, NULL, NULL));

  TEST_ASSERT_EQUAL_STRING("Hello World Hello", str);
}

void test_sl_string__replace_last_substring_not_found(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_TRUE(sl_string__replace_last(str, "hey", "World"));
  TEST_ASSERT_EQUAL_STRING("Hello World Hello", str);
}

void test_sl_string__replace_all_successful(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_EQUAL_INT(2, sl_string__replace_all(str, "Hello", "World"));
  TEST_ASSERT_EQUAL_STRING("World World World", str);
}

void test_sl_string__replace_all_null_params(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_EQUAL_INT(-1, sl_string__replace_all(str, NULL, "World"));
  TEST_ASSERT_EQUAL_INT(-1, sl_string__replace_all(str, "Hello", NULL));
  TEST_ASSERT_EQUAL_INT(-1, sl_string__replace_all(str, NULL, NULL));

  TEST_ASSERT_EQUAL_STRING("Hello World Hello", str);
}

void test_sl_string__replace_all_substring_not_found(void) {
  sl_string__append(str, "Hello World Hello");

  TEST_ASSERT_EQUAL_INT(0, sl_string__replace_all(str, "hey", "World"));
  TEST_ASSERT_EQUAL_STRING("Hello World Hello", str);
}

void test_sl_string__replace_all_double_slash_with_slash(void) {
  const char *expected_filename = "sibros/can_module/logs/debuglog__predump.in_use";
  const sl_string_t directory_name = "sibros/can_module/logs/";
  const sl_string_t preceding_name = "debuglog";
  const sl_string_t tagname = "predump";
  static sl_string_t file_name = sl_string__initialize(string_memory, sizeof(string_memory) - string_memory_pad_size);
  const int printed_count = sl_string__printf(file_name, "%s/%s__%s.in_use", directory_name, preceding_name, tagname);
  TEST_ASSERT_EQUAL_INT(strlen(file_name), printed_count);
  // replace double slash with slash from middle of the string
  TEST_ASSERT_EQUAL_INT(1, sl_string__replace_all(file_name, "//", "/"));
  TEST_ASSERT_EQUAL_STRING(expected_filename, file_name);

  sl_string_t string_with_slash = "/sibros/can_module/logs/debuglog__predump.in_use";
  // adding slash in the beginning of string_with_slash
  sl_string__printf(file_name, "/%s", string_with_slash); // re-use file_name
  // replace double slash with slash from beginning of the string
  TEST_ASSERT_EQUAL_INT(1, sl_string__replace_all(file_name, "//", "/"));
  TEST_ASSERT_EQUAL_STRING(string_with_slash, file_name);

  string_with_slash = "/sibros/can_module/logs/";
  // adding slash at the end of string_with_slash
  sl_string__printf(file_name, "%s/", string_with_slash); // re-use file_name
  // replace double slash with slash from end of the string
  TEST_ASSERT_EQUAL_INT(1, sl_string__replace_all(file_name, "//", "/"));
  TEST_ASSERT_EQUAL_STRING(string_with_slash, file_name);
}
